submission/tests/2-test-runs/checkout-with-coupon/soak/html-report-130vu/statistics.json
{
  "Step 1 POST login" : {
    "transaction" : "Step 1 POST login",
    "sampleCount" : 7826,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 5.361487349859444,
    "medianResTime" : 4.0,
    "minResTime" : 0.0,
    "maxResTime" : 691.0,
    "pct1ResTime" : 10.0,
    "pct2ResTime" : 15.0,
    "pct3ResTime" : 26.0,
    "throughput" : 10.895821412112934,
    "receivedKBytesPerSec" : 7.284578108880248,
    "sentKBytesPerSec" : 2.7877980566148333
  },
  "Step 7 GET my-orders" : {
    "transaction" : "Step 7 GET my-orders",
    "sampleCount" : 7712,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 5.27048755186723,
    "medianResTime" : 4.0,
    "minResTime" : 0.0,
    "maxResTime" : 187.0,
    "pct1ResTime" : 10.0,
    "pct2ResTime" : 15.0,
    "pct3ResTime" : 25.0,
    "throughput" : 10.916539151335336,
    "receivedKBytesPerSec" : 24.589209002552902,
    "sentKBytesPerSec" : 3.769892236864269
  },
  "Step 2 GET categories" : {
    "transaction" : "Step 2 GET categories",
    "sampleCount" : 7804,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4.2570476678626346,
    "medianResTime" : 3.0,
    "minResTime" : 0.0,
    "maxResTime" : 111.0,
    "pct1ResTime" : 9.0,
    "pct2ResTime" : 14.0,
    "pct3ResTime" : 24.0,
    "throughput" : 10.929390312560397,
    "receivedKBytesPerSec" : 3.8210173163052947,
    "sentKBytesPerSec" : 2.0065677526966352
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 54364,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 6.345522772422922,
    "medianResTime" : 3.0,
    "minResTime" : 0.0,
    "maxResTime" : 691.0,
    "pct1ResTime" : 15.0,
    "pct2ResTime" : 21.0,
    "pct3ResTime" : 28.0,
    "throughput" : 75.68667798077901,
    "receivedKBytesPerSec" : 50.77977076566561,
    "sentKBytesPerSec" : 22.612274864884995
  },
  "Step 3 GET products search" : {
    "transaction" : "Step 3 GET products search",
    "sampleCount" : 7778,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4.289148881460541,
    "medianResTime" : 3.0,
    "minResTime" : 0.0,
    "maxResTime" : 88.0,
    "pct1ResTime" : 9.0,
    "pct2ResTime" : 14.0,
    "pct3ResTime" : 23.0,
    "throughput" : 10.917625128785305,
    "receivedKBytesPerSec" : 4.93214191061598,
    "sentKBytesPerSec" : 2.1430104012557094
  },
  "Step 5 POST apply-coupon" : {
    "transaction" : "Step 5 POST apply-coupon",
    "sampleCount" : 7748,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 6.135647909137854,
    "medianResTime" : 4.0,
    "minResTime" : 0.0,
    "maxResTime" : 162.0,
    "pct1ResTime" : 13.0,
    "pct2ResTime" : 19.0,
    "pct3ResTime" : 32.0,
    "throughput" : 10.926711494201001,
    "receivedKBytesPerSec" : 4.261842654755123,
    "sentKBytesPerSec" : 2.8527992889281726
  },
  "Step 6 POST checkout" : {
    "transaction" : "Step 6 POST checkout",
    "sampleCount" : 7731,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 16.696287673004743,
    "medianResTime" : 15.0,
    "minResTime" : 6.0,
    "maxResTime" : 144.0,
    "pct1ResTime" : 24.0,
    "pct2ResTime" : 27.0,
    "pct3ResTime" : 36.0,
    "throughput" : 10.925170144934091,
    "receivedKBytesPerSec" : 3.3592424054805323,
    "sentKBytesPerSec" : 4.70148038634488
  },
  "Step 4 POST cart" : {
    "transaction" : "Step 4 POST cart",
    "sampleCount" : 7765,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.467739858338693,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 58.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 4.0,
    "pct3ResTime" : 10.0,
    "throughput" : 10.925063770575068,
    "receivedKBytesPerSec" : 3.136688231004951,
    "sentKBytesPerSec" : 4.59650662424323
  }
}