submission/tests/2-test-runs/checkout-with-coupon/soak/html-report-230vu/statistics.json
{
  "Step 1 POST login" : {
    "transaction" : "Step 1 POST login",
    "sampleCount" : 13778,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 9.75743939613871,
    "medianResTime" : 4.0,
    "minResTime" : 1.0,
    "maxResTime" : 256.0,
    "pct1ResTime" : 21.0,
    "pct2ResTime" : 33.04999999999927,
    "pct3ResTime" : 76.0,
    "throughput" : 19.180706253149683,
    "receivedKBytesPerSec" : 12.837205987427714,
    "sentKBytesPerSec" : 4.90756351398947
  },
  "Step 7 GET my-orders" : {
    "transaction" : "Step 7 GET my-orders",
    "sampleCount" : 13581,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 13.146675502540365,
    "medianResTime" : 8.0,
    "minResTime" : 1.0,
    "maxResTime" : 260.0,
    "pct1ResTime" : 26.0,
    "pct2ResTime" : 39.0,
    "pct3ResTime" : 90.0,
    "throughput" : 19.1876507313517,
    "receivedKBytesPerSec" : 71.86119813631765,
    "sentKBytesPerSec" : 6.633230819236817
  },
  "Step 2 GET categories" : {
    "transaction" : "Step 2 GET categories",
    "sampleCount" : 13742,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 8.556105370397304,
    "medianResTime" : 3.0,
    "minResTime" : 0.0,
    "maxResTime" : 227.0,
    "pct1ResTime" : 20.0,
    "pct2ResTime" : 30.0,
    "pct3ResTime" : 75.13999999999942,
    "throughput" : 19.19563286082258,
    "receivedKBytesPerSec" : 6.710973207201644,
    "sentKBytesPerSec" : 3.5241982205416456
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 95747,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 10.961105830992077,
    "medianResTime" : 12.0,
    "minResTime" : 0.0,
    "maxResTime" : 311.0,
    "pct1ResTime" : 51.0,
    "pct2ResTime" : 75.0,
    "pct3ResTime" : 144.0,
    "throughput" : 133.27978774789773,
    "receivedKBytesPerSec" : 117.67065029045813,
    "sentKBytesPerSec" : 39.843021647073115
  },
  "Step 3 GET products search" : {
    "transaction" : "Step 3 GET products search",
    "sampleCount" : 13714,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 8.91147732244424,
    "medianResTime" : 3.0,
    "minResTime" : 0.0,
    "maxResTime" : 253.0,
    "pct1ResTime" : 20.0,
    "pct2ResTime" : 32.0,
    "pct3ResTime" : 80.85000000000036,
    "throughput" : 19.202683951042538,
    "receivedKBytesPerSec" : 8.674964683703202,
    "sentKBytesPerSec" : 3.7692768302339354
  },
  "Step 5 POST apply-coupon" : {
    "transaction" : "Step 5 POST apply-coupon",
    "sampleCount" : 13648,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 13.135917350527562,
    "medianResTime" : 5.0,
    "minResTime" : 1.0,
    "maxResTime" : 311.0,
    "pct1ResTime" : 29.0,
    "pct2ResTime" : 46.0,
    "pct3ResTime" : 123.51000000000022,
    "throughput" : 19.191153620628803,
    "receivedKBytesPerSec" : 7.485300665039281,
    "sentKBytesPerSec" : 5.017062877639522
  },
  "Step 6 POST checkout" : {
    "transaction" : "Step 6 POST checkout",
    "sampleCount" : 13613,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 19.58297215896567,
    "medianResTime" : 15.0,
    "minResTime" : 7.0,
    "maxResTime" : 259.0,
    "pct1ResTime" : 30.0,
    "pct2ResTime" : 43.0,
    "pct3ResTime" : 94.0,
    "throughput" : 19.18750845699337,
    "receivedKBytesPerSec" : 5.921145187900298,
    "sentKBytesPerSec" : 8.264020032238763
  },
  "Step 4 POST cart" : {
    "transaction" : "Step 4 POST cart",
    "sampleCount" : 13671,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3.7201375173725344,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 127.0,
    "pct1ResTime" : 6.0,
    "pct2ResTime" : 12.0,
    "pct3ResTime" : 34.280000000000655,
    "throughput" : 19.19251336147655,
    "receivedKBytesPerSec" : 5.510350515892681,
    "sentKBytesPerSec" : 8.081829326352748
  }
}