submission/tests/2-test-runs/checkout-with-coupon/stress/20260813-stress-smoke.log
2026-08-13 20:15:57,045 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2026-08-13 20:15:57,639 INFO o.a.j.JMeter: Loading user properties from: C:\tools\apache-jmeter-5.6.3\bin\user.properties
2026-08-13 20:15:57,644 INFO o.a.j.JMeter: Loading system properties from: C:\tools\apache-jmeter-5.6.3\bin\system.properties
2026-08-13 20:15:57,705 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2026-08-13 20:15:57,706 INFO o.a.j.JMeter: Version 5.6.3
2026-08-13 20:15:57,707 INFO o.a.j.JMeter: java.version=21.0.9
2026-08-13 20:15:57,708 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2026-08-13 20:15:57,709 INFO o.a.j.JMeter: os.name=Windows 11
2026-08-13 20:15:57,709 INFO o.a.j.JMeter: os.arch=amd64
2026-08-13 20:15:57,711 INFO o.a.j.JMeter: os.version=10.0
2026-08-13 20:15:57,714 INFO o.a.j.JMeter: file.encoding=UTF-8
2026-08-13 20:15:57,714 INFO o.a.j.JMeter: java.awt.headless=true
2026-08-13 20:15:57,715 INFO o.a.j.JMeter: Max memory     =1073741824
2026-08-13 20:15:57,719 INFO o.a.j.JMeter: Available Processors =16
2026-08-13 20:15:57,804 INFO o.a.j.JMeter: Default Locale=English (EN)
2026-08-13 20:15:57,806 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2026-08-13 20:15:57,807 INFO o.a.j.JMeter: JMeterHome=C:\tools\apache-jmeter-5.6.3
2026-08-13 20:15:57,808 INFO o.a.j.JMeter: user.dir  =G:\HCMUS\NAM3-HK3\Testing\Homework\HW5\hcmus-sw-testing--eshop-sut
2026-08-13 20:15:57,811 INFO o.a.j.JMeter: PWD       =G:\HCMUS\NAM3-HK3\Testing\Homework\HW5\hcmus-sw-testing--eshop-sut
2026-08-13 20:15:57,818 INFO o.a.j.JMeter: IP: 192.168.2.35 Name: QuocTan FullName: storefront.yas.local.com
2026-08-13 20:15:57,892 INFO o.a.j.s.FileServer: Default base='G:\HCMUS\NAM3-HK3\Testing\Homework\HW5\hcmus-sw-testing--eshop-sut'
2026-08-13 20:15:57,901 INFO o.a.j.s.FileServer: Set new base='G:\HCMUS\NAM3-HK3\Testing\Homework\HW5\hcmus-sw-testing--eshop-sut\submission\tests\1-test-plans\checkout-with-coupon'
2026-08-13 20:15:59,493 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2026-08-13 20:16:01,065 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2026-08-13 20:16:01,168 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2026-08-13 20:16:01,388 INFO o.a.j.s.SaveService: Loading file: submission\tests\1-test-plans\checkout-with-coupon\23127115_Stress_20260813.jmx
2026-08-13 20:16:02,295 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-08-13 20:16:02,295 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-08-13 20:16:02,295 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-08-13 20:16:02,296 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2026-08-13 20:16:02,296 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2026-08-13 20:16:02,297 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2026-08-13 20:16:02,774 INFO o.a.j.JMeter: Creating summariser <summary>
2026-08-13 20:16:02,858 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2026-08-13 20:16:02,860 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-08-13 20:16:02,861 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2026-08-13 20:16:02,888 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2026-08-13 20:16:02,889 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2026-08-13 20:16:04,058 INFO o.a.j.JMeter: Running test (1786626964057)
2026-08-13 20:16:04,114 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Stage 1 - 50 VUs
2026-08-13 20:16:04,114 INFO o.a.j.e.StandardJMeterEngine: Starting 50 threads for group Stage 1 - 50 VUs.
2026-08-13 20:16:04,115 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2026-08-13 20:16:04,115 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=50 ramp-up=30 delayedStart=false
2026-08-13 20:16:04,214 INFO o.a.j.t.JMeterThread: Thread started: Stage 1 - 50 VUs 1-1
2026-08-13 20:16:04,235 INFO o.a.j.s.FileServer: Stored: test-data/users.csv
2026-08-13 20:16:04,371 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2026-08-13 20:16:04,371 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 2 : Stage 2 - 50 VUs starting at minute 5
2026-08-13 20:16:04,371 INFO o.a.j.e.StandardJMeterEngine: Starting 50 threads for group Stage 2 - 50 VUs starting at minute 5.
2026-08-13 20:16:04,371 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2026-08-13 20:16:04,372 INFO o.a.j.t.ThreadGroup: Starting thread group... number=2 threads=50 ramp-up=30 delayedStart=false
2026-08-13 20:16:04,596 INFO o.a.j.t.ThreadGroup: Started thread group number 2
2026-08-13 20:16:04,596 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 3 : Stage 3 - 50 VUs starting at minute 10
2026-08-13 20:16:04,597 INFO o.a.j.e.StandardJMeterEngine: Starting 50 threads for group Stage 3 - 50 VUs starting at minute 10.
2026-08-13 20:16:04,597 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2026-08-13 20:16:04,598 INFO o.a.j.t.ThreadGroup: Starting thread group... number=3 threads=50 ramp-up=30 delayedStart=false
2026-08-13 20:16:04,802 INFO o.a.j.t.JMeterThread: Thread started: Stage 1 - 50 VUs 1-2
2026-08-13 20:16:05,112 INFO o.a.j.t.ThreadGroup: Started thread group number 3
2026-08-13 20:16:05,113 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 4 : Stage 4 - 50 VUs starting at minute 15
2026-08-13 20:16:05,116 INFO o.a.j.e.StandardJMeterEngine: Starting 50 threads for group Stage 4 - 50 VUs starting at minute 15.
2026-08-13 20:16:05,117 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2026-08-13 20:16:05,117 INFO o.a.j.t.ThreadGroup: Starting thread group... number=4 threads=50 ramp-up=30 delayedStart=false
2026-08-13 20:16:05,371 INFO o.a.j.t.ThreadGroup: Started thread group number 4
2026-08-13 20:16:05,371 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2026-08-13 20:16:05,405 INFO o.a.j.t.JMeterThread: Thread started: Stage 1 - 50 VUs 1-3
2026-08-13 20:16:05,609 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = QuocTan
2026-08-13 20:16:05,747 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2026-08-13 20:16:05,769 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2026-08-13 20:16:05,770 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2026-08-13 20:16:05,770 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2026-08-13 20:16:05,770 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2026-08-13 20:16:05,994 INFO o.a.j.t.JMeterThread: Thread started: Stage 1 - 50 VUs 1-4
2026-08-13 20:16:06,574 INFO o.a.j.t.JMeterThread: Thread started: Stage 1 - 50 VUs 1-5
2026-08-13 20:16:07,176 INFO o.a.j.t.JMeterThread: Thread started: Stage 1 - 50 VUs 1-6
2026-08-13 20:16:07,765 INFO o.a.j.t.JMeterThread: Thread started: Stage 1 - 50 VUs 1-7
2026-08-13 20:16:08,358 INFO o.a.j.t.JMeterThread: Thread started: Stage 1 - 50 VUs 1-8
2026-08-13 20:16:08,970 INFO o.a.j.t.JMeterThread: Thread started: Stage 1 - 50 VUs 1-9
2026-08-13 20:16:09,570 INFO o.a.j.t.JMeterThread: Thread started: Stage 1 - 50 VUs 1-10
2026-08-13 20:16:10,151 INFO o.a.j.t.JMeterThread: Thread started: Stage 1 - 50 VUs 1-11
2026-08-13 20:16:10,741 INFO o.a.j.t.JMeterThread: Thread started: Stage 1 - 50 VUs 1-12
2026-08-13 20:16:11,339 INFO o.a.j.t.JMeterThread: Thread started: Stage 1 - 50 VUs 1-13
2026-08-13 20:16:11,939 INFO o.a.j.t.JMeterThread: Thread started: Stage 1 - 50 VUs 1-14
2026-08-13 20:16:12,540 INFO o.a.j.t.JMeterThread: Thread started: Stage 1 - 50 VUs 1-15
2026-08-13 20:16:13,135 INFO o.a.j.t.JMeterThread: Thread started: Stage 1 - 50 VUs 1-16
2026-08-13 20:16:13,734 INFO o.a.j.t.JMeterThread: Thread started: Stage 1 - 50 VUs 1-17
2026-08-13 20:16:14,336 INFO o.a.j.t.JMeterThread: Thread started: Stage 1 - 50 VUs 1-18
2026-08-13 20:16:14,947 INFO o.a.j.t.JMeterThread: Thread started: Stage 1 - 50 VUs 1-19
2026-08-13 20:16:15,541 INFO o.a.j.t.JMeterThread: Thread started: Stage 1 - 50 VUs 1-20
2026-08-13 20:16:16,138 INFO o.a.j.t.JMeterThread: Thread started: Stage 1 - 50 VUs 1-21
2026-08-13 20:16:16,737 INFO o.a.j.t.JMeterThread: Thread started: Stage 1 - 50 VUs 1-22
2026-08-13 20:16:17,330 INFO o.a.j.t.JMeterThread: Thread started: Stage 1 - 50 VUs 1-23
2026-08-13 20:16:17,938 INFO o.a.j.t.JMeterThread: Thread started: Stage 1 - 50 VUs 1-24
2026-08-13 20:16:18,527 INFO o.a.j.t.JMeterThread: Thread started: Stage 1 - 50 VUs 1-25
2026-08-13 20:16:19,138 INFO o.a.j.t.JMeterThread: Thread started: Stage 1 - 50 VUs 1-26
2026-08-13 20:16:19,733 INFO o.a.j.t.JMeterThread: Thread started: Stage 1 - 50 VUs 1-27
2026-08-13 20:16:20,340 INFO o.a.j.t.JMeterThread: Thread started: Stage 1 - 50 VUs 1-28
2026-08-13 20:16:20,928 INFO o.a.j.t.JMeterThread: Thread started: Stage 1 - 50 VUs 1-29
2026-08-13 20:16:21,526 INFO o.a.j.t.JMeterThread: Thread started: Stage 1 - 50 VUs 1-30
2026-08-13 20:16:22,131 INFO o.a.j.t.JMeterThread: Thread started: Stage 1 - 50 VUs 1-31
2026-08-13 20:16:22,727 INFO o.a.j.t.JMeterThread: Thread started: Stage 1 - 50 VUs 1-32
2026-08-13 20:16:23,330 INFO o.a.j.t.JMeterThread: Thread started: Stage 1 - 50 VUs 1-33
2026-08-13 20:16:23,935 INFO o.a.j.t.JMeterThread: Thread started: Stage 1 - 50 VUs 1-34
2026-08-13 20:16:24,532 INFO o.a.j.t.JMeterThread: Thread started: Stage 1 - 50 VUs 1-35
2026-08-13 20:16:25,126 INFO o.a.j.t.JMeterThread: Thread started: Stage 1 - 50 VUs 1-36
2026-08-13 20:16:25,735 INFO o.a.j.t.JMeterThread: Thread started: Stage 1 - 50 VUs 1-37
2026-08-13 20:16:26,328 INFO o.a.j.t.JMeterThread: Thread started: Stage 1 - 50 VUs 1-38
2026-08-13 20:16:26,934 INFO o.a.j.t.JMeterThread: Thread started: Stage 1 - 50 VUs 1-39
2026-08-13 20:16:27,526 INFO o.a.j.t.JMeterThread: Thread started: Stage 1 - 50 VUs 1-40
2026-08-13 20:16:28,125 INFO o.a.j.t.JMeterThread: Thread started: Stage 1 - 50 VUs 1-41
2026-08-13 20:16:28,732 INFO o.a.j.t.JMeterThread: Thread started: Stage 1 - 50 VUs 1-42
2026-08-13 20:16:29,325 INFO o.a.j.t.JMeterThread: Thread started: Stage 1 - 50 VUs 1-43
2026-08-13 20:16:29,927 INFO o.a.j.t.JMeterThread: Thread started: Stage 1 - 50 VUs 1-44
2026-08-13 20:16:30,016 INFO o.a.j.r.Summariser: summary +    399 in 00:00:26 =   15.4/s Avg:    45 Min:     2 Max:   914 Err:     0 (0.00%) Active: 44 Started: 44 Finished: 0
2026-08-13 20:16:30,535 INFO o.a.j.t.JMeterThread: Thread started: Stage 1 - 50 VUs 1-45
2026-08-13 20:16:31,125 INFO o.a.j.t.JMeterThread: Thread started: Stage 1 - 50 VUs 1-46
2026-08-13 20:16:31,727 INFO o.a.j.t.JMeterThread: Thread started: Stage 1 - 50 VUs 1-47
2026-08-13 20:16:32,334 INFO o.a.j.t.JMeterThread: Thread started: Stage 1 - 50 VUs 1-48
2026-08-13 20:16:32,937 INFO o.a.j.t.JMeterThread: Thread started: Stage 1 - 50 VUs 1-49
2026-08-13 20:16:33,528 INFO o.a.j.t.JMeterThread: Thread started: Stage 1 - 50 VUs 1-50
2026-08-13 20:17:00,041 INFO o.a.j.r.Summariser: summary +   1331 in 00:00:30 =   44.3/s Avg:    91 Min:     2 Max:  1338 Err:     0 (0.00%) Active: 50 Started: 50 Finished: 0
2026-08-13 20:17:00,245 INFO o.a.j.r.Summariser: summary =   1730 in 00:00:56 =   30.9/s Avg:    80 Min:     2 Max:  1338 Err:     0 (0.00%)